Revit 2027 API
ParameterTypeId.RoofAttrDefaultThicknessParam Property
 "Default Thickness"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofAttrDefaultThicknessParam { get; }
Public Shared ReadOnly Property RoofAttrDefaultThicknessParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofAttrDefaultThicknessParam {
	ForgeTypeId^ get ();
}
static member RoofAttrDefaultThicknessParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace